app/views/pages/home.html.erb

                <% for annuncio in @annunci_home do%>
                    <% user = User.find_by(id: annuncio.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]