app/views/pages/news.html.erb

SELECT "newposts".* FROM "newposts"
---
            <div id="bacheca-news">
                <% Newpost.all.each do |newpost|%>