app/views/pages/profile.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 34], ["LIMIT", 1]]
---
                        <div class="user owner">
                            <%= User.find(Team.find(myRequest.team_id).leader_id).username %>