app/controllers/newpost_controller.rb

  def news
    @game = params[:game];
    url = URI.parse('https://euw1.api.riotgames.com/lol/platform/v3/champion-rotations');
    http = Net::HTTP.new(url.host, url.port)
    http.use_ssl = true if url.scheme == 'https'

    request = Net::HTTP::Get.new(url)
    request['X-Riot-Token'] = ENV['RIOT_API_KEY']

    @rotation_champs = JSON.parse(http.request(request).body)['freeChampionIds']

    @newpost=Newpost.all
---
SELECT "newposts".* FROM "newposts" ORDER BY "newposts"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def index
      @newposts = Newpost.all
---
SELECT "newposts".* FROM "newposts" ORDER BY "newposts"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def show
      @newpost=Newpost.find(params[:id])
---
SELECT "newposts".* FROM "newposts" WHERE "newposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]