app/controllers/registrations_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "506"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "username" = ? WHERE "users"."id" = ?  [["updated_at", "2024-02-05 10:30:25.165488"], ["username", "aristotel212"], ["id", 39]]
---
    def create
      super do |resource|
        if resource.is_a?(User)
          resource.add_role(:user)


          if request.get? && !resource.username.present?
            # Affinchè non mi dia errore quando apro la pagina per la prima volta
            return
          end
          username = resource.username
          if username_valid?(username)
            if !username_exists?(username)
              resource.update(username: username)