app/models/user.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "role", "provider", "uid", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "google_oauth2"], ["uid", "112501511128065731668"], ["LIMIT", 1]]
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

SELECT 1 AS one FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "853"], ["LIMIT", 1]]
---
  def generate_unique_uid
    random_uid = SecureRandom.random_number(1_000)

    while User.exists?(uid: random_uid)